blog/2016-05-15-tcp网络的各个状态总结.org
#+TITLE: TCP网络的多种状态
#+DATE: 2016-05-15
#+SETUPFILE: ~/myblog/setupfile.org
#+JEKYLL_LAYOUT: post
#+JEKYLL_CATEGORIES: 网络知识
#+JEKYLL_TAGS: TCP/IP
#+JEKYLL_PUBLISHED: true

* 局域网的相关术语
- =CSMA/CD=: 解决局域网内不同主机同时发送的冲突问题(冲突域)
- =广播域=: 交换机通过广播信号确定数据的目的地
- =MAC(Media Access Control)=: 总共48bits地址, 前24bits由国际组织分配
- =路由器=: 切割广播域, 连接广播域
- =IP=: Internet Protocol
- =Routing protocol=: 路由器判断包的转发端口, 以求最快到达
- =ARP=: 局域网内IP与MAC的转换
- =网关=: 若目的地与自己不在同一网络的时候所发送的地方
- =套接字=: 不同主机的进程的通讯接口, 包含ip和端口号

* TCP特性
- 建立连接：三次握手
- 将数据打包成段：校验和（CRC-32）
- 确认、重传以及超时
- 排序：逻辑序号
- 流量控制：滑动窗口算法
- 拥塞控制：慢启动和拥塞避免算法

* TCP/IP分层
- =application layer=
- =transport layer=: tcp, udp, sctp，提供进程间的通信，包括tcp和udp协议，端口号是0-65535
- =internet layer=: ip，提供主机间的通信
- =datalink layer=: mac，提供设备间的通信
- =pysical layer=
  
* TCP/IP的连接协议（三次握手）
1. 客户端发送一个带 =SYN= 标志的TCP报文到服务器
2. 服务器回应客户端一个同时带 =ACK= 和 =SYN= 标志的报文
3. 客户端最后回服务器端一个 =ACK= 报文

* TCP/IP的终止协议（四次挥手）
由于TCP连接是全双工的，因此每个方向都必须单独进行关闭。收到一个FIN只意味着这一方向上没有数据流动了，一个TCP连接在收到一个FIN后仍能发送数据。
1. 客户端发送一个 =FIN= 报文，关闭客户端到服务器端的数据传输
2. 服务器端收到这个 =FIN= 报文后回应一个确认序号加1的 =ACK= 报文
3. 服务器端准备关闭客户端的连接，发送一个 =FIN= 报文给客户端
4. 客户端收到后回应一个 =ACK= 报文

* TCP/IP的连接状态
| 状态        | 状态说明                                                                 |
|-------------+--------------------------------------------------------------------------|
| CLOSED      | 初始关闭状态                                                             |
| LISTEN      | 服务器端处于监听状态，等待接受连接                                       |
| SYN_RCVD    | 服务器端收到客户端的SYN报文                                              |
| SYN_SEND    | 客户端发送SYN报文后的等待状态                                            |
| ESTABLISHED | 三次握手后建立连接的状态                                                 |
| FIN_WAIT_1  | 主动终止的一方（客户端）发送FIN报文后的状态（未收到ACK报文）             |
| FIN_WAIT_2  | 主动终止的一方发送FIN报文后的状态（已收到ACK报文）                       |
| TIME_WAIT   | 主动终止的一方收到了对方的FIN报文，并发送的ACK报文，2MSL后回到CLOSED状态 |
| CLOSING     | 在FIN_WAIT_1的状态时先收到对方的FIN报文时进入的状态                      |
| CLOSE_WAIT  | 被动终止的一方收到对方的FIN报文回应ACK报文后的状态                       |
| LAST_ACK    | 被动终止的一方发送FIN报文后等待对方的ACK报文的状态                       |
